<template>
  <div class="product-list">
    <mcv-product
        v-for="product in products"
        :product_data="product"
        :key="product.id"
    ></mcv-product>
  </div>
</template>

<script>
import McvProduct from "@/components/Product";

export default {
  name: "McvProductList",
  components: {McvProduct},
  data: () => ({
    products: [
      {
        id: 1,
        header: 'Наименование товара',
        description: 'Довольно-таки интересное описание товара в несколько строк. Довольно-таки интересное описание товара в несколько строк',
        price: '10 000 руб.'
      },
      {
        id: 2,
        header: 'Наименование товара',
        description: 'Довольно-таки интересное описание товара в несколько строк. Довольно-таки интересное описание товара в несколько строк',
        price: '10 000 руб.'
      },
      {
        id: 3,
        header: 'Наименование товара',
        description: 'Довольно-таки интересное описание товара в несколько строк. Довольно-таки интересное описание товара в несколько строк',
        price: '10 000 руб.'
      },
      {
        id: 4,
        header: 'Наименование товара',
        description: 'Довольно-таки интересное описание товара в несколько строк. Довольно-таки интересное описание товара в несколько строк',
        price: '10 000 руб.'
      },
      {
        id: 5,
        header: 'Наименование товара',
        description: 'Довольно-таки интересное описание товара в несколько строк. Довольно-таки интересное описание товара в несколько строк',
        price: '10 000 руб.'
      },
      {
        id: 6,
        header: 'Наименование товара',
        description: 'Довольно-таки интересное описание товара в несколько строк. Довольно-таки интересное описание товара в несколько строк',
        price: '10 000 руб.'
      },
      {
        id: 7,
        header: 'Наименование товара',
        description: 'Довольно-таки интересное описание товара в несколько строк. Довольно-таки интересное описание товара в несколько строк',
        price: '10 000 руб.'
      },
      {
        id: 8,
        header: 'Наименование товара',
        description: 'Довольно-таки интересное описание товара в несколько строк. Довольно-таки интересное описание товара в несколько строк',
        price: '10 000 руб.'
      },
      {
        id: 9,
        header: 'Наименование товара',
        description: 'Довольно-таки интересное описание товара в несколько строк. Довольно-таки интересное описание товара в несколько строк',
        price: '10 000 руб.'
      },
      {
        id: 10,
        header: 'Наименование товара',
        description: 'Довольно-таки интересное описание товара в несколько строк. Довольно-таки интересное описание товара в несколько строк',
        price: '10 000 руб.'
      },
    ]
  }),
}
</script>

<style scoped>

</style>